app/models/user.rb

  def self.find_for_database_authentication warden_condition
    conditions = warden_condition.dup
    login = conditions.delete(:login)
    where(conditions).where(
      ["lower(username) = :value OR lower(email) = :value",
      { value: login.strip.downcase}]).first
---
SELECT "users".* FROM "users" WHERE (lower(username) = 'gdguesser' OR lower(email) = 'gdguesser') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]